NXP/mcu-viznlc/rt106f_smart_lock/board/pin_mux.c
void BOARD_InitLPSPI4Pins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_B0_03_LPSPI4_SCK,        /* GPIO_B0_03 is configured as LPSPI4_SCK */
		  0U);                                    /* Software Input On Field: Input Path is determined by functionality */

#ifdef SPI4_USE_PCS
  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_B0_00_LPSPI4_PCS0,       /* GPIO_B0_00 is configured as LPSPI4_PCS0 */
		  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
#else
  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_B0_00_GPIO2_IO00,       /* GPIO_B0_00 is configured as LPSPI4_PCS0 */
		  0U);                                    /* Software Input On Field: Input Path is determined by functionality */

#endif

  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_B0_02_LPSPI4_SDO,        /* GPIO_B0_02 is configured as LPSPI4_SDO */
		  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
		  IOMUXC_GPIO_B0_01_LPSPI4_SDI,        /* GPIO_B0_01 is configured as LPSPI4_SDI */
		  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_B0_03_LPSPI4_SCK,        /* GPIO_B0_03 PAD functional properties : */
		  0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                   Drive Strength Field: R0/6
                                                   Speed Field: medium(100MHz)
                                                   Open Drain Enable Field: Open Drain Disabled
                                                   Pull / Keep Enable Field: Pull/Keeper Enabled
                                                   Pull / Keep Select Field: Keeper
                                                   Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                   Hyst. Enable Field: Hysteresis Disabled */
#ifdef SPI4_USE_PCS
  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_B0_00_LPSPI4_PCS0,       /* GPIO_B0_00 PAD functional properties : */
		  0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                   Drive Strength Field: R0/6
                                                   Speed Field: medium(100MHz)
                                                   Open Drain Enable Field: Open Drain Disabled
                                                   Pull / Keep Enable Field: Pull/Keeper Enabled
                                                   Pull / Keep Select Field: Keeper
                                                   Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                   Hyst. Enable Field: Hysteresis Disabled */
#else
  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_B0_00_GPIO2_IO00,       /* GPIO_B0_00 PAD functional properties : */
		  0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                   Drive Strength Field: R0/6
                                                   Speed Field: medium(100MHz)
                                                   Open Drain Enable Field: Open Drain Disabled
                                                   Pull / Keep Enable Field: Pull/Keeper Enabled
                                                   Pull / Keep Select Field: Keeper
                                                   Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                   Hyst. Enable Field: Hysteresis Disabled */
#endif

  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_B0_02_LPSPI4_SDO,        /* GPIO_B0_02 PAD functional properties : */
		  0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                   Drive Strength Field: R0/6
                                                   Speed Field: medium(100MHz)
                                                   Open Drain Enable Field: Open Drain Disabled
                                                   Pull / Keep Enable Field: Pull/Keeper Enabled
                                                   Pull / Keep Select Field: Keeper
                                                   Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                   Hyst. Enable Field: Hysteresis Disabled */
  IOMUXC_SetPinConfig(
		  IOMUXC_GPIO_B0_01_LPSPI4_SDI,        /* GPIO_B0_01 PAD functional properties : */
		  0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
                                                   Drive Strength Field: R0/6
                                                   Speed Field: medium(100MHz)
                                                   Open Drain Enable Field: Open Drain Disabled
                                                   Pull / Keep Enable Field: Pull/Keeper Enabled
                                                   Pull / Keep Select Field: Keeper
                                                   Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                   Hyst. Enable Field: Hysteresis Disabled */
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlash
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlash(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  /* GPIO configuration on GPIO_AD_B0_05 (pin G14) */
  gpio_pin_config_t gpio1_pinG14_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_AD_B0_05 (pin G14) */
  GPIO_PinInit(GPIO1, 5U, &gpio1_pinG14_config);

